/****************************************Copyright (c)****************************************************
**                                        
**                                 
**
**--------------File Info---------------------------------------------------------------------------------
** File name:			main.c
** Last modified Date: 2015-4-16         
** Last Version:		1.2
** Descriptions:							
**--------------------------------------------------------------------------------------------------------
** Created by:			FiYu
** Created date:		2014-11-12
** Version:			    1.0
** Descriptions:		FLASH读写实验程序			
**--------------------------------------------------------------------------------------------------------
** Modified by:			FiYu
** Modified date:		
** Version:				
** Descriptions:		
** Rechecked by:			
**********************************************************************************************************/
#include <stdio.h> 
#include <reg24le1.h>
#include <stdint.h>
#include "hal_uart.h"
#include "hal_clk.h"
#include "hal_delay.h"
#include "hal_flash.h"
#include "HAL_FLASH_HW.h"

/*-------------------管脚定义--------------------------------------------------*/
#define  D1    P00  // 开发板上的指示灯D1
#define  S1    P12  // 开发板上的按键S1


/* 开发板中nRF24LE1管脚配置
P00：输出，驱动D1	       P12：输入，按键检测S1  
P01：输出，驱动D2			   P13：输入，按键检测S2
P02：输出，OLED时钟			 P14：输出，OLED数据
P03：输出，UART TXD			 P15：输出，OLED片选
P04：输入，UART RXD			 P16：输出，OLED命令/数据选择
P06：输入，AIN6  AD检测  蜂鸣器驱动(通过跳线选择)
*/

uint8_t idata WriteBuf[5];
uint8_t idata temp_data[5];

/*******************************************************************************************************
 * 描  述 : 配置 IO P0.0为输出P03：输出,作为UART TXD，P04：输入,作为UART RXD
 * 入  参 : 无
 * 返回值 : 无
 *******************************************************************************************************/
void IO_Init(void)
{	
	P0DIR &= ~0x01;	   //配置P0.0和P0.1为输出
	P0DIR &= ~0x08;    //P03：输出，UART TXD
	P0DIR |= 0x10;     //P04：输入，UART RXD	
	D1 = 1;            //设置D4初始状态为熄灭
}

/*******************************************************************************************************
 * 描  述 : 串口打印16进制字符
 * 入  参 : 输出的字符
 * 返回值 : 无
 *******************************************************************************************************/
void PutHexString (uint8_t x)
{
  uint8_t c;

  c = (x>>4)& 0xf;
  if (c > 9)
    hal_uart_putchar('A'+c-10);
  else
    hal_uart_putchar('0'+c);

    c = x & 0xf;
  if (c > 9)
    hal_uart_putchar('A'+c-10);
  else
   hal_uart_putchar('0'+c);
}

/*******************************************************************************************************
 * 描  述 : 串口输出字符串
 * 入  参 : 无
 * 返回值 : 无
 *******************************************************************************************************/
void PutString(char *s)
{
  while(*s != 0)
    hal_uart_putchar(*s++);
}

/*******************************************************************************************************
 * 描  述 :向FLASH中写入多个字节数据
 * 入  参 : a:起始地址  *p:写入的数据存放地址 n:写入的字节数
 * 返回值 : 无
 *******************************************************************************************************/
void flash_bytes_write(uint16_t a, const uint8_t *p, uint16_t n)
{
  uint8_t xdata *pb;
  
  F0 = EA; //保存中断设置
  EA = 0;  //关闭中断

  WEN = 1;//使能flash写操作

  pb = (uint8_t xdata *)a; 
	
  while(n--)
  {
    PCON |= 0x10;//置位pmw，使能对FLASH的访问
	  *pb = *p;    //写入一字节数据
	  PCON &= ~0x10;//清除pmw，关闭对FLASH的访问

	  pb++;
    p++;

    while(RDYN == 1)//等待操作完成
      ;
  }

  WEN = 0;

  EA = F0; // Restore interrupt enable state
}

/*******************************************************************************************************
 * 描  述 : 从FLASH中读出多个字节数据
 * 入  参 : a:起始地址  *p:数据存放地址 n:读出的字节数
 * 返回值 : 无
 *******************************************************************************************************/
void flash_bytes_read(uint16_t a, uint8_t *p, uint16_t n)
{  
  uint8_t xdata *pb = (uint8_t xdata *)a;
	
  while(n--)
  {
    PCON |= 0x10;  //置位pmw，使能对FLASH的访问
	  *p = *pb;      //读出一字节数据
	  PCON &= ~0x10; //清除pmw，关闭对FLASH的访问

    pb++;
    p++;
  }
}

/*******************************************************************************************************
 * 描  述 : 主函数
 * 入  参 : 无
 * 返回值 : 无
 *******************************************************************************************************/
void main(void)
{ 
  uint8_t i;
  uint32_t LoopCount = 0;

  hal_clk_set_16m_source(HAL_CLK_XOSC16M);            //使用外部16MHz晶振

  IO_Init();  //配置IO  
  hal_uart_init(UART_BAUD_57K6); // 初始化UART0                     
  while(hal_clk_get_16m_source() != HAL_CLK_XOSC16M) //等待时钟稳定
  ;  
    
  EA = 1;// 使能全局中断

  while(1)
  {	
	  LoopCount++;
	  if(LoopCount == 10000) //D1闪烁指示程序正常运行
	  {
	    D1 = ~D1;
	    LoopCount = 0;
	  }
	  if(S1 == 0)
	  {
	    delay_ms(10);
			
	    if(S1 == 0)	  //按键S1按下
	    {
        hal_flash_page_erase(20); //写之前先擦除
		    delay_ms(30);
		    for(i=0;i<5;i++) WriteBuf[i] = i+1;
  	    flash_bytes_write(0x2800,WriteBuf,5); //写入数据
		    flash_bytes_read(0x2800,temp_data,5); //读出数据
		    PutString("Flash address 0x2800~0x2804:"); //串口打印出0x2800~0x2804上的数据
		    for(i=0;i<5;i++)PutHexString(temp_data[i]);
				while(S1==0);	//等待按键释放
	    }
	  }	 
  }
}
 /*********************************END FILE****************************************************************/	