/****************************************Copyright (c)****************************************************
**                                        
**                                 
**
**--------------File Info---------------------------------------------------------------------------------
** File name:			main.c
** Last modified Date: 2015-4-16         
** Last Version:		   1.2
** Descriptions:							
**--------------------------------------------------------------------------------------------------------
** Created by:			FiYu
** Created date:		2014-11-12
** Version:			    1.0
** Descriptions:		GPIO控制蜂鸣器(需要短接跳线JP1和蜂鸣器相连的一端)					
**--------------------------------------------------------------------------------------------------------
** Modified by:			FiYu
** Modified date:		
** Version:				
** Descriptions:		
** Rechecked by:			
**********************************************************************************************************/
#include <reg24le1.h>
#include <stdio.h> 
#include <stdint.h>
#include <stdbool.h>
#include "hal_delay.h"


/*-------------------管脚定义--------------------------------------------------*/
#define  BEEP    P06  //定义P06为蜂鸣器驱动管脚


/* 开发板中nRF24LE1管脚配置
P00：输出，驱动D1	       P12：输入，按键检测S1  
P01：输出，驱动D2			   P13：输入，按键检测S2
P02：输出，OLED时钟			 P14：输出，OLED数据
P03：输出，UART TXD			 P15：输出，OLED片选
P04：输入，UART RXD			 P16：输出，OLED命令/数据选择
P06：输入，AIN6  AD检测  蜂鸣器驱动(通过跳线选择)
*/

/*******************************************************************************************************
 * Description : main loop
 * Parameters  : none
 * Return      : none
 *******************************************************************************************************/
void main(void)
{ 
  P0DIR &= ~0x40;	   //配置P0.6为输出

  while(true)
  {
	  BEEP = 1;           //蜂鸣器鸣响
		delay_ms(200);      //延时200ms
		BEEP = 0;           //停止鸣响
		delay_ms(200);	    
  }
}

 /*********************************END FILE****************************************************************/	