/****************************************Copyright (c)****************************************************
**                                        
**                                 
**
**--------------File Info---------------------------------------------------------------------------------
** File name:			main.c
** Last modified Date: 2015-4-16         
** Last Version:		1.2
** Descriptions:							
**--------------------------------------------------------------------------------------------------------
** Created by:			FiYu
** Created date:		2014-11-12
** Version:			    1.0
** Descriptions:		UART数据收发实验		
**--------------------------------------------------------------------------------------------------------
** Modified by:			FiYu
** Modified date:		
** Version:				
** Descriptions:		
** Rechecked by:			
**********************************************************************************************************/
#include <stdio.h> 
#include <reg24le1.h>
#include <stdint.h>
#include "hal_uart.h"
#include "hal_clk.h"
#include "hal_delay.h"


/*-------------------管脚定义--------------------------------------------------*/
#define  D1    P00  // 开发板上的指示灯D1

#define BAUD_57K6   1015  // = Round(1024 - (2*16e6)/(64*57600))
#define BAUD_38K4   1011  // = Round(1024 - (2*16e6)/(64*38400))
#define BAUD_19K2    998  // = Round(1024 - (2*16e6)/(64*19200))
#define BAUD_9K6     972  // = Round(1024 - (2*16e6)/(64*9600))


/* 开发板中nRF24LE1管脚配置
P00：输出，驱动D1	       P12：输入，按键检测S1  
P01：输出，驱动D2			   P13：输入，按键检测S2
P02：输出，OLED时钟			 P14：输出，OLED数据
P03：输出，UART TXD			 P15：输出，OLED片选
P04：输入，UART RXD			 P16：输出，OLED命令/数据选择
P06：输入，AIN6  AD检测  蜂鸣器驱动(通过跳线选择)
*/


/*******************************************************************************************************
 * 描  述 : 配置 IO P0.0和P0.1为输出P03：输出,作为UART TXD，P04：输入,作为UART RXD
 * 入  参 : 无
 * 返回值 : 无
 *******************************************************************************************************/
void IO_Init(void)
{	
	P0DIR &= ~0x01;	   //配置P0.0和P0.1为输出
	P0DIR &= ~0x08;    //P03：输出，UART TXD
	P0DIR |= 0x10;     //P04：输入，UART RXD	
	D1 = 1;            //设置D1初始状态为熄灭
}

/*******************************************************************************************************
 * 描  述 : 串口初始化
 * 入  参 : 无
 * 返回值 : 无
 *******************************************************************************************************/
void uart_init(uint16_t baud)
{	
  S0CON = 0x50;     //8位UART
  PCON |= 0x80; 		// SMOD = 1
  ADCON |= 0x80;    // 使用内部波特率发生器	 	

  S0RELL = (uint8_t)baud;  //设置波特率
  S0RELH = (uint8_t)(baud >> 8);
}

/*******************************************************************************************************
 * 描  述 : 串口输出字符
 * 入  参 : 无
 * 返回值 : 无
 *******************************************************************************************************/
void uart_sendchar(uint8_t dat)
{
  S0BUF = dat;
  while(!TI0);
  TI0 = 0;
}

/*******************************************************************************************************
 * 描  述 : 串口输出字符串
 * 入  参 : 无
 * 返回值 : 无
 *******************************************************************************************************/
void PutString(char *s)
{
  while(*s != 0)
    uart_sendchar(*s++);
}

/*******************************************************************************************************
 * 描  述 : 主函数
 * 入  参 : 无
 * 返回值 : 无
 *******************************************************************************************************/
void main(void)
{ 
  uint32_t loopcount = 0;
	uint8_t temp_char;
  
  IO_Init();  //配置IO

  uart_init(BAUD_57K6);                    

  while(hal_clk_get_16m_source() != HAL_CLK_XOSC16M) //等待时钟稳定
  ;
 
  EA = 1;  // 使能全局中断                                           
  PutString("Welcome to FiYu!\n");

  while(1)
  {
    loopcount++;
	  if(loopcount == 15000)	// D1闪烁，指示设备工作正常
	  {
	    loopcount = 0;
	    D1 = ~D1;
	  }
		
    if(RI0==1)//UART接收到数据 
    {  
      temp_char = S0BUF; //读取数据
      RI0 = 0;
      S0BUF = temp_char; //返回接收的数据
      while(!TI0);
      TI0=0;
    }
  }
}
/*********************************END FILE****************************************************************/